namespace WuhanJamesHubApi
{
    public static class AddressConstants
    {
        #region 常量数据

        public static string ChineseData =
@"
北京市:东城区,西城区,朝阳区,丰台区,石景山区,海淀区,门头沟区,房山区,通州区,顺义区,昌平区,大兴区,怀柔区,平谷区,密云区,延庆区
天津市:和平区,河东区,河西区,南开区,河北区,红桥区,东丽区,西青区,津南区,北辰区,武清区,宝坻区,滨海新区,宁河区,静海区,蓟州区
上海市:黄浦区,徐汇区,长宁区,静安区,普陀区,虹口区,杨浦区,闵行区,宝山区,嘉定区,浦东新区,金山区,松江区,青浦区,奉贤区,崇明区
重庆市:万州区,涪陵区,渝中区,大渡口区,江北区,沙坪坝区,九龙坡区,南岸区,北碚区,渝北区,巴南区,黔江区,长寿区,合川区,永川区,江津区,南川区,綦江区,大足区,璧山区,铜梁区,潼南区,荣昌区,梁平区,城口县,丰都县,垫江县,武隆区,忠县,云阳县,奉节县,巫山县,巫溪县,石柱土家族自治县,秀山土家族苗族自治县,酉阳土家族苗族自治县,彭水苗族土家族自治县
河北省:石家庄市,唐山市,秦皇岛市,邯郸市,邢台市,保定市,张家口市,承德市,沧州市,廊坊市,衡水市
山西省:太原市,大同市,阳泉市,长治市,晋城市,朔州市,晋中市,运城市,忻州市,临汾市,吕梁市
内蒙古自治区:呼和浩特市,包头市,乌海市,赤峰市,通辽市,鄂尔多斯市,呼伦贝尔市,巴彦淖尔市,乌兰察布市,兴安盟,锡林郭勒盟,阿拉善盟
辽宁省:沈阳市,大连市,鞍山市,抚顺市,本溪市,丹东市,锦州市,营口市,阜新市,辽阳市,盘锦市,铁岭市,朝阳市,葫芦岛市
吉林省:长春市,吉林市,四平市,辽源市,通化市,白山市,松原市,白城市,延边朝鲜族自治州
黑龙江省:哈尔滨市,齐齐哈尔市,鸡西市,鹤岗市,双鸭山市,大庆市,伊春市,佳木斯市,七台河市,牡丹江市,黑河市,绥化市,大兴安岭地区
江苏省:南京市,无锡市,徐州市,常州市,苏州市,南通市,连云港市,淮安市,盐城市,扬州市,镇江市,泰州市,宿迁市
浙江省:杭州市,宁波市,温州市,嘉兴市,湖州市,绍兴市,金华市,衢州市,舟山市,台州市,丽水市
安徽省:合肥市,芜湖市,蚌埠市,淮南市,马鞍山市,淮北市,铜陵市,安庆市,黄山市,滁州市,阜阳市,宿州市,六安市,亳州市,池州市,宣城市
福建省:福州市,厦门市,莆田市,三明市,泉州市,漳州市,南平市,龙岩市,宁德市
江西省:南昌市,景德镇市,萍乡市,九江市,新余市,鹰潭市,赣州市,吉安市,宜春市,抚州市,上饶市
山东省:济南市,青岛市,淄博市,枣庄市,东营市,烟台市,潍坊市,济宁市,泰安市,威海市,日照市,临沂市,德州市,聊城市,滨州市,菏泽市
河南省:郑州市,开封市,洛阳市,平顶山市,安阳市,鹤壁市,新乡市,焦作市,濮阳市,许昌市,漯河市,三门峡市,南阳市,商丘市,信阳市,周口市,驻马店市,济源市
湖北省:武汉市,黄石市,十堰市,宜昌市,襄阳市,鄂州市,荆门市,孝感市,荆州市,黄冈市,咸宁市,随州市,恩施土家族苗族自治州
湖南省:长沙市,株洲市,湘潭市,衡阳市,邵阳市,岳阳市,常德市,张家界市,益阳市,郴州市,永州市,怀化市,娄底市,湘西土家族苗族自治州
广东省:广州市,韶关市,深圳市,珠海市,汕头市,佛山市,江门市,湛江市,茂名市,肇庆市,惠州市,梅州市,汕尾市,河源市,阳江市,清远市,东莞市,中山市,潮州市,揭阳市,云浮市
广西壮族自治区:南宁市,柳州市,桂林市,梧州市,北海市,防城港市,钦州市,贵港市,玉林市,百色市,贺州市,河池市,来宾市,崇左市
海南省:海口市,三亚市,三沙市,儋州市
四川省:成都市,自贡市,攀枝花市,泸州市,德阳市,绵阳市,广元市,遂宁市,内江市,乐山市,南充市,眉山市,宜宾市,广安市,达州市,雅安市,巴中市,资阳市,阿坝藏族羌族自治州,甘孜藏族自治州,凉山彝族自治州
贵州省:贵阳市,六盘水市,遵义市,安顺市,毕节市,铜仁市,黔西南布依族苗族自治州,黔东南苗族侗族自治州,黔南布依族苗族自治州
云南省:昆明市,曲靖市,玉溪市,保山市,昭通市,丽江市,普洱市,临沧市,楚雄彝族自治州,红河哈尼族彝族自治州,文山壮族苗族自治州,西双版纳傣族自治州,大理白族自治州,德宏傣族景颇族自治州,怒江傈僳族自治州,迪庆藏族自治州
西藏自治区:拉萨市,日喀则市,昌都市,林芝市,山南市,那曲市,阿里地区
陕西省:西安市,铜川市,宝鸡市,咸阳市,渭南市,延安市,汉中市,榆林市,安康市,商洛市
甘肃省:兰州市,嘉峪关市,金昌市,白银市,天水市,武威市,张掖市,平凉市,酒泉市,庆阳市,定西市,陇南市,临夏回族自治州,甘南藏族自治州
青海省:西宁市,海东市,海北藏族自治州,黄南藏族自治州,海南藏族自治州,果洛藏族自治州,玉树藏族自治州,海西蒙古族藏族自治州
宁夏回族自治区:银川市,石嘴山市,吴忠市,固原市,中卫市
新疆维吾尔自治区:乌鲁木齐市,克拉玛依市,吐鲁番市,哈密市,昌吉回族自治州,博尔塔拉蒙古自治州,巴音郭楞蒙古自治州,阿克苏地区,克孜勒苏柯尔克孜自治州,喀什地区,和田地区,伊犁哈萨克自治州,塔城地区,阿勒泰地区
香港特别行政区:
澳门特别行政区:
台湾省:台北市,高雄市,台中市,台南市,新北市,基隆市,新竹市,嘉义市
美国:
加拿大:
英国:
澳大利亚:
德国:
法国:
日本:
韩国:
新加坡:
新西兰:
意大利:
西班牙:
俄罗斯:
马来西亚:
泰国:
荷兰:
瑞士:
瑞典:
比利时:
爱尔兰:
阿联酋:
南非:
丹麦:
奥地利:
挪威:
芬兰:
巴西:
阿根廷:
印度:
土耳其:
波兰:
匈牙利:
捷克:
葡萄牙:
希腊:
以色列:
墨西哥:
智利:
哥伦比亚:
乌克兰:
哈萨克斯坦:
埃及:
沙特阿拉伯:";

        private static string KoreanData =
@"
북경시:동성구,서성구,조양구,봉태구,석경산구,해정구,문두구구,방산구,통주구,순의구,창평구,대흥구,회유구,평곡구,밀운구,연경구
천진시:화평구,하동구,하서구,남개구,하북구,홍교구,동려구,서청구,진남구,북진구,무청구,보지구,빈해신구,녕하구,정해구,계주구
상해시:황포구,서휘구,장녕구,정안구,보타구,홍구구,양포구,민행구,보산구,가정구,포동신구,김산구,송강구,청포구,봉현구,숭명구
중경시:만주구,부릉구,유중구,대도구구,강북구,사평파구,구용파구,남안구,북배구,유북구,파남구,검강구,장수구,합천구,영천구,강진구,남천구,기강구,대족구,벽산구,동량구,동남구,영창구,양평구,성구현,봉도현,점강현,무륭구,충현,운양현,봉절현,무산현,무계현,석주토가족자치현,수산토가족묘족자치현,유양토가족묘족자치현,팽수묘족토가족자치현
하북성:석가장시,당산시,진황도시,감단시,형태시,보정시,장가구시,승덕시,창주시,낭방시,형수시
산서성:태원시,대동시,양천시,장치시,진성시,삭주시,진중시,운성시,흔주시,임분시,여량시
내몽고자치구:호화호특시,포두시,오해시,적봉시,통료시,악이다사시,호륜패이시,파언뇨이시,오란찰포시,흥안맹,석림곽륵맹,아라선맹
요녕성:심양시,대련시,안산시,무순시,본계시,단동시,금주시,영구시,부신시,요양시,반금시,철령시,조양시,호호도시
길림성:장춘시,길림시,사평시,요원시,통화시,백산시,송원시,백성시,연변조선족자치주
흑용강성:하이빈시,제제하이시,계서시,학강시,쌍압산시,대경시,이춘시,가목사시,칠태하시,모단강시,흑하시,수화시,대흥안령지구
강소성:남경시,무석시,서주시,상주시,소주시,남통시,연운항시,회안시,염성시,양주시,진강시,태주시,숙천시
절강성:항주시,녕파시,온주시,가흥시,호주시,소흥시,김화시,구주시,주산시,태주시,여수시
안휘성:합비시,무호시,방부시,회남시,마안산시,회북시,동릉시,안경시,황산시,저주시,부양시,숙주시,육안시,박주시,지주시,선성시
복건성:복주시,하문시,보전시,삼명시,천주시,장주시,남평시,용암시,녕덕시
강서성:남창시,경덕진시,평향시,구강시,신여시,응담시,공주시,길안시,의춘시,무주시,상요시
산동성:제남시,청도시,치박시,조장시,동영시,연태시,유방시,제녕시,태안시,위해시,일조시,임기시,덕주시,요성시,빈주시,하택시
하남성:정주시,개봉시,낙양시,평정산시,안양시,학벽시,신향시,초작시,복양시,허창시,탑하시,삼문협시,남양시,상구시,신양시,주구시,주마점시,제원시
호북성:무한시,황석시,십언시,의창시,양양시,악주시,형문시,효감시,형주시,황강시,함녕시,수주시,은시토가족묘족자치주
호남성:장사시,주주시,상담시,형양시,소양시,악양시,상덕시,장가계시,익양시,침주시,영주시,회화시,누저시,상서토가족묘족자치주
광동성:광주시,소관시,심천시,주해시,산두시,불산시,강문시,담강시,무명시,조경시,혜주시,매주시,산미시,하원시,양강시,청원시,동완시,중산시,조주시,게양시,운부시
광서장족자치구:남녕시,유주시,계림시,오주시,북해시,방성항시,흠주시,귀항시,옥림시,백색시,하주시,하지시,내빈시,숭좌시
해남성:해구시,삼아시,삼사시,담주시
사천성:성도시,자공시,반지화시,노주시,덕양시,면양시,광원시,수녕시,내강시,낙산시,남충시,미산시,의빈시,광안시,달주시,아안시,파중시,자양시,아파장족강족자치주,감자장족자치주,양산이족자치주
귀주성:귀양시,육반수시,준의시,안순시,필절시,동인시,검서남포의족묘족자치주,검동남묘족동족자치주,검남포의족묘족자치주
운남성:곤명시,곡정시,옥계시,보산시,소통시,여강시,보이시,임창시,초웅이족자치주,홍하하니족이족자치주,문산장족묘족자치주,서쌍판납태족자치주,대리백족자치주,덕굉태족경파족자치주,노강률속족자치주,적경장족자치주
서장자치구:나살시,일객칙시,창도시,임지시,산남시,나곡시,아리지구
합서성:서안시,동천시,보계시,함양시,위남시,연안시,한중시,유림시,안강시,상락시
감숙성:난주시,가욕관시,김창시,백은시,천수시,무위시,장액시,평량시,주천시,경양시,정서시,농남시,임하회족자치주,감남장족자치주
청해성:서녕시,해동시,해북장족자치주,황남장족자치주,해남장족자치주,과락장족자치주,옥수장족자치주,해서몽고족장족자치주
녕하회족자치구:은천시,석취산시,오충시,고원시,중위시
신강유오이자치구:오로목제시,극라마의시,토로번시,하밀시,창길회족자치주,박이탑라몽고자치주,파음곽릉몽고자치주,아극소지구,극자륵소가이극자자치주,객십지구,화전지구,이리하살극자치주,탑성지구,아륵태지구
향항특별행정구:
오문특별행정구:
태만성:태북시,고웅시,태중시,태남시,신북시,기륭시,신죽시,가의시
미국:
가나대:
영국:
오대리아:
덕국:
법국:
일본:
한국:
신가파:
신서란:
의대리:
서반아:
아라사:
마래서아:
태국:
하란:
서사:
서전:
비리시:
애이란:
아련추:
남비:
단맥:
오지리:
나위:
분란:
파서:
아근정:
인도:
토이기:
파란:
흉아리:
첩극:
포도아:
희석:
이색렬:
묵서가:
지리:
가륜비아:
오극란:
하살극사탄:
애급:
사특아라백:";

        #endregion

        public static Dictionary<string, List<string>> ChineseCityDic;
        public static Dictionary<string, List<string>> KoreanCityDic;

        static AddressConstants()
        {
            Func<string, Dictionary<string, List<string>>> loadDic = (str) =>
            {
                var lines = str.Split("\r\n");
                var dic = new Dictionary<string, List<string>>();
                foreach (var line in lines)
                {
                    var pc = line.Split(':', StringSplitOptions.RemoveEmptyEntries);
                    if (pc.Length > 1)
                    {
                        dic.Add(pc[0], pc[1].Split(',', StringSplitOptions.RemoveEmptyEntries).ToList());
                    }
                }
                return dic;
            };

            ChineseCityDic = loadDic(ChineseData);
            KoreanCityDic = loadDic(KoreanData);
        }
    }
}